src/main/java/br/com/infotera/it/tboholiday/newXMLDocument.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Header>
        <Credentials xmlns="http://TekTravel/HotelBookingApi" UserName="InfoteraTest" Password="Inf@64890970"/>
    </soap:Header>
    <soap:Body>
        <HotelBookRequest xmlns="http://TekTravel/HotelBookingApi">
            <ClientReferenceNumber>230420161357000#TBOH</ClientReferenceNumber>
            <GuestNationality>BR</GuestNationality>
            <Guests>
                <Guest LeadGuest="true" GuestType="Adult" GuestInRoom="1">
                    <Title>MR</Title>
                    <FirstName>URBINA</FirstName>
                    <LastName>ANDRADE</LastName>
                    <Age>39</Age>
                </Guest>
                <Guest LeadGuest="false" GuestType="Adult" GuestInRoom="1">
                    <Title>MR</Title>
                    <FirstName>LITO</FirstName>
                    <LastName>FERNANDES</LastName>
                    <Age>39</Age>
                </Guest>
                <Guest LeadGuest="false" GuestType="Adult" GuestInRoom="2">
                    <Title>MR</Title>
                    <FirstName>BRIZIDA</FirstName>
                    <LastName>FERNANDES</LastName>
                    <Age>39</Age>
                </Guest>
                <Guest LeadGuest="false" GuestType="Adult" GuestInRoom="2">
                    <Title>MR</Title>
                    <FirstName>ANALIDE</FirstName>
                    <LastName>BARCELLOS</LastName>
                    <Age>39</Age>
                </Guest>
            </Guests>
            <PaymentInfo VoucherBooking="true" PaymentModeType="Limit"/>
            <SessionId>237c13b3-c5fd-48a2-93e9-700014b00a1b</SessionId>
            <NoOfRooms>2</NoOfRooms>
            <ResultIndex>1</ResultIndex>
            <HotelCode>1246485</HotelCode>
            <HotelName>Hotel Joamar</HotelName>
            <HotelRooms>
                <HotelRoom>
                    <RoomIndex>1</RoomIndex>
                    <RoomTypeName>Standard Twin Room,2 Twin Beds,Nonsmoking</RoomTypeName>
                    <RoomTypeCode>201470146|207343287$37341^^2^^201470146|207343287|37341</RoomTypeCode>
                    <RatePlanCode>201470146|207343287|37341</RatePlanCode>
                    <RoomRate RoomFare="20.46" RoomTax="1.02" TotalFare="21.48"/>
                </HotelRoom>
                <HotelRoom>
                    <RoomIndex>2</RoomIndex>
                    <RoomTypeName>Standard Twin Room,2 Twin Beds,Nonsmoking</RoomTypeName>
                    <RoomTypeCode>201470146|207343287$37341^^2^^201470146|207343287|37341</RoomTypeCode>
                    <RatePlanCode>201470146|207343287|37341</RatePlanCode>
                    <RoomRate RoomFare="20.46" RoomTax="1.02" TotalFare="21.48"/>
                </HotelRoom>
            </HotelRooms>
            <RestrictDuplicateBooking>true</RestrictDuplicateBooking>
        </HotelBookRequest>
    </soap:Body>
</soap:Envelope>
